const {
    afterBeforeRange,
    allMenuItems
} = {
    afterBeforeRange: document.querySelectorAll('.after-before-range'),
    allMenuItems: $('.menu-item')
}

const {
    navFix,
    nav,
    activeMenu
} = {
    navFix: 'fixed-nav',
    nav: 'nav',
    activeMenu: 'active-menu'
}

afterBeforeRange.forEach((item) => {
    item.addEventListener("input", function (e){
        const value = +this.value;
        this.previousElementSibling.previousElementSibling.style.width = `${value}%`;
        this.previousElementSibling.style.width = `${100 - value} %`;

        if(value === 100 || value === 0){
            this.previousElementSibling.previousElementSibling.style.borderRight = '0';
        } else {
            this.previousElementSibling.previousElementSibling.style.borderRight = '2px solid #fff';
        }

    })
});


$('#sale-section').slick({
    dots: true,
    infinite: true,
    speed: 300,
    slidesToShow: 3,
    slidesToScroll: 3,
    prevArrow: '<button class="slick-prev"><i class="fa-solid fa-chevron-left"></i></button>',
    nextArrow: '<button class="slick-next"><i class="fa-solid fa-chevron-right"></i></button>',
    responsive: [
        {
            breakpoint: 991,
            settings: {
                slidesToShow: 2,
                slidesToScroll: 2,
            }
        },
        {
            breakpoint: 576,
            settings: {
                slidesToShow: 1,
                slidesToScroll: 1
            }
        }
    ]
});


$('#reviews').slick({
    dots: true,
    infinite: true,
    speed: 300,
    slidesToShow: 3,
    slidesToScroll: 3,
    prevArrow: '<button class="slick-prev"><i class="fa-solid fa-chevron-left"></i></button>',
    nextArrow: '<button class="slick-next"><i class="fa-solid fa-chevron-right"></i></button>',
    responsive: [
        {
            breakpoint: 991,
            settings: {
                slidesToShow: 2,
                slidesToScroll: 2,
            }
        },
        {
            breakpoint: 576,
            settings: {
                slidesToShow: 1,
                slidesToScroll: 1
            }
        }
    ]
});


$(window).on('scroll', function (e){
    e.stopPropagation();
    const windowTop = $(window).scrollTop();
    windowTop >= 50 ? $(nav).addClass(navFix) : $(nav).removeClass(navFix);

    $('.menu-item').map((index, elem) => {
        const url = $(elem).attr('href');
        const id = url === '#' ? null : url;
        if(id){
            const section = $(`${id}`);
            const elemTop = section.offset().top;
            if(windowTop >= elemTop - 300 && windowTop < elemTop + section.height()){
                allMenuItems.removeClass(activeMenu);
                $(elem).addClass(activeMenu);
            }
        }
    })
}).scroll()



const servicesInfo = [
    {
        name: 'ДИАГНОСТИКА',
        img: 'https://picsum.photos/636/300/?random=1',
        prices: [
            ['Консультация. Первичный осмотр полости рта', '500'],
            ['Консультация врача-имплантолога', '500'],
            ['Профосмотр и выдача справки', '500'],
            ['Электроодонтодиагностика', '200'],
            ['Восковое моделирование 1 ед.', '300'],
            ['КСнятие диагностического слепка + изготовление модели', '2000'],
            ['Дентальный снимок (диагностический)', '400'],
            ['Дентальный снимок (диагностический) кол-во 2', '700'],
            ['Дентальный снимок (диагностический) кол-во 3', '1000'],
            ['Дентальный снимок (с распечатыванием)', '450'],
        ]
    },
    {
        name: 'ГИГИЕНА',
        img: 'https://picsum.photos/636/300/?random=2',
        prices: [
            ['Снятие мягкого зубного налета методом Air Flow (1 челюсть)', '1500'],
            ['Снятие твердых зубных отложений ультразвуком (1 челюсть)', '1500'],
            ['Полная профессиональная чистка зубов', '4000'],
            ['Химическое отбеливание в зоне улыбки', '7000'],
            ['Покрытие фторлаком одного зуба', '100'],
            ['Снятие твердых зубных отложений с одного зуба с полировкой', '150']
        ]
    },
    {
        name: 'ТЕРАПЕВТИЧЕСКАЯ СТОМАТОЛОГИЯ',
        img: 'https://picsum.photos/636/300/?random=3',
        prices: [
            ['Анестезия аппликационная', '100'],
            ['Анестезия инфильтрационная', '500'],
            ['Анестезия проводниковая', '500'],
            ['Лечение поверхностного кариеса', '2500'],
            ['Лечение кариеса в пределах дентина 1 поверхность', '3000'],
            ['Лечение кариеса в пределах дентина 2 поверхности', '3500'],
            ['Лечение кариеса в пределах дентина 3 поверхности', '4000'],
            ['Пломба стеклоиономерный цемент Fuji, Adhesor', '2500'],
            ['Пломба под коронку', '2500'],
            ['Художественная реставрация ESTELITE ASTERIA', '6000'],
            ['Временная пломба (дентин-паста, septo-pack)', '350'],
            ['Наложение коффердама', '500'],
            ['Наложение девитализирующей пасты', '200'],
            ['Установка титанового винтового штифта', '1500'],
            ['Установка стекловолоконного штифта', '2000'],
            ['Наложение пасты Пульпотек', '500'],
        ]
    },
    {
        name: 'ЭНДОДОНТИЧЕСКОЕ ЛЕЧЕНИЕ',
        img: 'https://picsum.photos/636/300/?random=4',
        prices: [
            ['Инструментальная, медикаментозная обработка и пломбирование корневого канала при лечении пульпита (периодонтита) 1- корневого зуба', '4500'],
            ['Инструментальная, медикаментозная обработка и пломбирование корневого канала при лечении пульпита (периодонтита) 2- корневого зуба', '6000'],
            ['Инструментальная, медикаментозная обработка и пломбирование корневого канала при лечении пульпита (периодонтита) 3- корневого зуба', '7000'],
            ['Химико-механическая обработка дополнительного канала ', '2000'],
            ['Распломбировка 1 корневого канала (паста)', '1000'],
            ['Распломбировка одного канала (р/формалин, цемент) или удаление штифта (вкладки)', '1500'],
            ['Временное (лечебное) пломбирование 1 корневого канала', '1000'],
        ]
    },
    {
        name: 'ПАРОДОНТОЛОГИЯ',
        img: 'https://picsum.photos/636/300/?random=5',
        prices: [
            ['Вскрытие пародонтального абсцесса (1 ед.)', '1000'],
            ['Лечение стоматита', '1000'],
            ['Гингивэктомия (1 сегмент)', '800'],
            ['Закрытый кюретаж пародонтологического кармана (1 ед)', '800'],
            ['Открытый кюретаж пародонтологического кармана (1 ед)', '1500'],
            ['Шинирование зубов (6 ед. включая материал)', '3000'],
            ['Наложение защитной повязки (солкосерил, септопак)', '500'],
            ['Пластика межзубного сосочка', '700'],
            ['Введение лекарственных препаратов в патологический зубодесневой канал ( в области одного зуба)', '300'],
        ]
    },
    {
        name: 'ОРТОПЕДИЧЕСКАЯ СТОМАТОЛОГИЯ',
        img: 'https://picsum.photos/636/300/?random=2',
        prices: [
            ['Снятие оттиска ( альгинат) 1 шт.', '500'],
            ['Снятие оттиска (С-силикон)', '500'],
            ['Снятие оттиска (А-силикон) ', '1000'],
            ['Временная коронка ( 1 ед.)', '2000'],
            ['Временная коронка на имплантате (прямой метод)', '2500'],
            ['Вкладка культевая 1 канал', '4000'],
            ['Вкладка культевая 2 канала', '4500'],
            ['Вкладка культевая 3 канала', '4500'],
            ['Консультация', '500'],
            ['Консультация', '500'],
            ['Консультация', '500'],
            ['Консультация', '500'],
            ['Консультация', '500'],
            ['Консультация', '500'],
            ['Консультация', '500'],
            ['Консультация', '500'],
            ['Консультация', '500'],
            ['Консультация', '500'],
            ['Консультация', '500'],
            ['Консультация', '500'],
            ['Консультация', '500'],
            ['Консультация', '500'],
            ['Консультация', '500'],
            ['Консультация', '500'],
            ['Консультация', '500'],
            ['Консультация', '500'],
            ['Консультация', '500'],
            ['Консультация', '500'],
            ['Консультация', '500'],
            ['Консультация', '500'],
            ['Консультация', '500'],
            ['Консультация', '500'],
            ['Консультация', '500'],
            ['Консультация', '500'],
            ['Консультация', '500'],
            ['Консультация', '500'],
            ['Консультация', '500'],
            ['Консультация', '500'],
            ['Консультация', '500'],
        ]
    },
    {
        name: 'ГИГИЕНА',
        img: 'https://picsum.photos/636/300/?random=2',
        prices: [
            ['Консультация', '500'],
            ['Консультация', '500'],
        ]
    },
]